<a href="https://colab.research.google.com/github/khan87adil/The-Data-Science-Workshop/blob/master/load_file.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
csv_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter01/Dataset/overall_topten_2012-2013.csv'

In [4]:
df=pd.read_csv(csv_url,skiprows=1)

In [5]:
df.head()

   Number  ...  Number of Applications
0       1  ...                    1069
1       2  ...                    1037
2       3  ...                     821
3       4  ...                     816
4       5  ...                     530

[5 rows x 4 columns]

In [7]:
df.shape

(10, 4)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Number                  10 non-null     int64
 1   Postcode                10 non-null     int64
 2   Suburbs                 10 non-null     object
 3   Number of Applications  10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

In [9]:
tsv_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter01/Dataset/overall_topten_2012-2013.tsv'

In [11]:
df1=pd.read_csv(tsv_url, skiprows=1, sep='\t')

In [13]:
df1.head()

   Number  ...  Number of Applications
0       1  ...                    1069
1       2  ...                    1037
2       3  ...                     821
3       4  ...                     816
4       5  ...                     530

[5 rows x 4 columns]

In [14]:
df1.shape

(10, 4)

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Number                  10 non-null     int64
 1   Postcode                10 non-null     int64
 2   Suburbs                 10 non-null     object
 3   Number of Applications  10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

In [16]:
xlsx_url = 'https://github.com/PacktWorkshops/The-Data-Science-Workshop/blob/master/Chapter01/Dataset/overall_topten_2012-2013.xlsx?raw=true'

In [21]:
df2=pd.read_excel(xlsx_url,skiprows=1, sheet_name=1)

In [23]:
df2.head()

   Number  ...  Number of Applications
0       1  ...                    1069
1       2  ...                    1037
2       3  ...                     821
3       4  ...                     816
4       5  ...                     530

[5 rows x 4 columns]